Tekla Open API Reference for Tekla Structures 2025
BaseRebarGroup.ExcludeType Property
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
EXCLUDE_TYPE_BOTH
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseRebarGroup.ExcludeTypeEnum ExcludeType { get; set; }
Public Property ExcludeType As BaseRebarGroup.ExcludeTypeEnum
	Get
	Set
Property Value
Type: BaseRebarGroup.ExcludeTypeEnum
See Also
Reference
BaseRebarGroup Class
Tekla.Structures.Model Namespace